Repository: Menahra/lasl
Catalog: apps/frontend/src/locales/*/messages.po
Languages: de_de, fr_fr

source: {0} may revise these Terms of Service at any time without notice. By using this platform, you agree to be bound by the current version of these Terms of Service.
de_de: {0} kann diese Nutzungsbedingungen jederzeit ohne vorherige Ankündigung ändern. Durch die Nutzung dieser Plattform erklären Sie sich mit der jeweils aktuellen Version dieser Nutzungsbedingungen einverstanden.
fr_fr: {0} peut réviser ces Conditions d'utilisation à tout moment sans préavis. En utilisant cette plateforme, vous acceptez d'être lié par la version actuelle de ces Conditions d'utilisation.

source: © {currentYear} {0}. All rights reserved.
de_de: © {currentYear} {0}. Alle Rechte vorbehalten
fr_fr: © {currentYear} {0}. Tous droits réservés.

source: <0>Account data is retained for the duration of the account</0><1>Learning progress data is deleted when the account is deleted</1><2>Technical and log data is retained for a limited period for security purposes</2>
de_de: <0>Kontodaten werden für die Dauer des Benutzerkontos gespeichert</0><1>Lernfortschrittsdaten werden bei Löschung des Kontos entfernt</1><2>Technische Daten und Protokolldaten werden aus Sicherheitsgründen nur für einen begrenzten Zeitraum gespeichert</2>
fr_fr: <0>Les données du compte sont conservées pendant toute la durée du compte</0><1>Les données de progression d'apprentissage sont supprimées lors de la suppression du compte</1><2>Les données techniques et les journaux sont conservés pendant une période limitée à des fins de sécurité</2>

source: <0>Identity data (such as name and email address)</0><1>Usage data (information about how you use the platform)</1><2>Technical data (such as IP address, browser type, and device information)</2>
de_de: <0>Identitätsdaten (z. B. Name und E-Mail-Adresse)</0><1>Nutzungsdaten (Informationen darüber, wie Sie die Plattform verwenden)</1><2>Technische Daten (z. B. IP-Adresse, Browsertyp und Geräteinformationen)</2>
fr_fr: <0>Données d'identité (telles que nom et adresse e-mail)</0><1>Données d'utilisation (informations sur la façon dont vous utilisez la plateforme)</1><2>Données techniques (telles que adresse IP, type de navigateur et informations sur l'appareil)</2>

source: <0>Modify or copy the materials</0><1>Use the materials for any commercial purpose</1><2>Attempt to reverse engineer any software contained on {0}</2><3>Remove any copyright or proprietary notations from the materials</3><4>Transfer the materials to another person or "mirror" the materials on any other server</4>
de_de: <0>Die Materialien zu verändern oder zu kopieren</0><1>Die Materialien für kommerzielle Zwecke zu nutzen</1><2>Zu versuchen, Software auf {0} zu dekompilieren oder zurückzuentwickeln</2><3>Urheberrechts- oder Eigentumsvermerke aus den Materialien zu entfernen</3><4>Die Materialien an Dritte weiterzugeben oder auf anderen Servern zu spiegeln</4>
fr_fr: <0>Modifier ou copier les contenus</0><1>Utiliser les contenus à des fins commerciales</1><2>Tenter de décompiler tout logiciel contenu sur {0}</2><3>Supprimer toute mention de droits d'auteur ou de propriété des contenus</3><4>Transférer les contenus à une autre personne ou « dupliquer » les contenus sur un autre serveur</4>

source: <0>Performance of a contract (Art. 6(1)(b) GDPR), where processing is necessary to provide user accounts and learning services</0><1>Legitimate interests (Art. 6(1)(f) GDPR), in particular to ensure the security and stability of the platform</1><2>Legal obligations (Art. 6(1)(c) GDPR), where processing is required by applicable law</2><3>Consent (Art. 6(1)(a) GDPR), where you have explicitly given consent</3>
de_de: <0>Vertragserfüllung (Art. 6 Abs. 1 lit. b DSGVO), soweit die Verarbeitung zur Bereitstellung von Benutzerkonten und Lernangeboten erforderlich ist</0><1>Berechtigte Interessen (Art. 6 Abs. 1 lit. f DSGVO), insbesondere zur Gewährleistung der Sicherheit und Stabilität der Plattform</1><2>Rechtliche Verpflichtungen (Art. 6 Abs. 1 lit. c DSGVO), sofern die Verarbeitung gesetzlich vorgeschrieben ist</2><3>Einwilligung (Art. 6 Abs. 1 lit. a DSGVO), sofern Sie diese ausdrücklich erteilt haben</3>
fr_fr: <0>Exécution d'un contrat (Art. 6(1)(b) RGPD), lorsque le traitement est nécessaire pour fournir des comptes utilisateurs et des services d'apprentissage</0><1>Intérêts légitimes (Art. 6(1)(f) RGPD), notamment pour assurer la sécurité et la stabilité de la plateforme</1><2>Obligations légales (Art. 6(1)(c) RGPD), lorsque le traitement est requis par la loi applicable</2><3>Consentement (Art. 6(1)(a) RGPD), lorsque vous avez explicitement donné votre consentement</3>

source: <0>Providing and maintaining the platform</0><1>Tracking learning progress and personalizing the experience</1><2>Improving the platform and developing new features</2><3>Ensuring security and preventing misuse</3><4>Complying with legal obligations</4>
de_de: <0>Bereitstellung und Betrieb der Plattform</0><1>Erfassung des Lernfortschritts und Personalisierung der Nutzererfahrung</1><2>Verbesserung der Plattform und Entwicklung neuer Funktionen</2><3>Gewährleistung der Sicherheit und Verhinderung von Missbrauch</3><4>Einhaltung gesetzlicher Verpflichtungen</4>
fr_fr: <0>Fournir et maintenir la plateforme</0><1>Suivre les progrès d'apprentissage et personnaliser l'expérience</1><2>Améliorer la plateforme et développer de nouvelles fonctionnalités</2><3>Assurer la sécurité et prévenir les abus</3><4>Respecter les obligations légales</4>

source: Accessible Everywhere
de_de: Überall
fr_fr: Accessible partout

source: Agreement to Terms
de_de: Zustimmung z den Nutzungsbedingungen
fr_fr: Acceptation des conditions

source: All content is stored as JSON documents that contributors can edit and improve.
de_de: Alle Inhalte werden als JSON-Dokumente gespeichert und können von Mitwirkenden bearbeitet und verbessert werden.
fr_fr: Tout le contenu est stocké sous forme de documents JSON que les contributeurs peuvent modifier et améliorer.

source: All content, features, and functionality on {0}, including but not limited to text, graphics, logos, and software, are the exclusive property of {1} and are protected by international copyright, trademark, and other intellectual property laws.
de_de: Alle Inhalte, Funktionen und Bestandteile auf {0}, einschließlich, aber nicht beschränkt auf Texte, Grafiken, Logos und Software, sind ausschließliches Eigentum von {1} und durch internationale Urheber-, Marken- und andere Schutzrechte des geistigen Eigentums geschützt.
fr_fr: Tout le contenu, les fonctionnalités et les fonctions de {0}, y compris mais sans s'y limiter les textes, graphiques, logos et logiciels, sont la propriété exclusive de {1} et sont protégés par les lois internationales sur le droit d'auteur, les marques et autres droits de propriété intellectuelle.

source: Already have an Account? <0>Sign In</0>
de_de: Sie haben bereits ein Konto? <0>Anmelden</0>
fr_fr: Vous avez déjà un compte ? <0>Se connecter</0>

source: An open, community-driven platform for learning Modern Standard Arabic. Explore Nahw, Sarf, Balagha, and more — with content you can help improve.
de_de: Eine offene, gemeinschaftsgetriebene Plattform zum Lernen des modernen Hocharabisch. Entdecken Sie Nahw, Sarf, Balagha und mehr – mit Inhalten, die Sie selbst mitgestalten können.
fr_fr: Une plateforme ouverte et communautaire pour apprendre l'arabe standard moderne. Explorez Nahw, Sarf, Balagha, et plus encore — avec du contenu que vous pouvez aider à améliorer.

source: Appropriate technical and organizational measures are implemented to protect personal data against accidental or unlawful loss, alteration, or unauthorized access.
de_de: Es werden geeignete technische und organisatorische Maßnahmen ergriffen, um personenbezogene Daten vor versehentlichem oder unrechtmäßigem Verlust, Veränderung oder unbefugtem Zugriff zu schützen.
fr_fr: Des mesures techniques et organisationnelles appropriées sont mises en œuvre pour protéger les données personnelles contre toute perte accidentelle ou illégale, altération ou accès non autorisé.

source: Arabic Grammar & Syntax
de_de: Arabische Grammatik & Syntax
fr_fr: Grammaire et syntaxe arabes

source: As the service provider, we are responsible for our own content on these pages in accordance with applicable laws.
de_de: Als Diensteanbieter sind wir gemäß den geltenden Gesetzen für eigene Inhalte auf diesen Seiten verantwortlich.
fr_fr: En tant que fournisseur de services, nous sommes responsables de notre propre contenu sur ces pages conformément aux lois applicables.

source: Automated Decision-Making
de_de: Automatisierte Entscheidungsfindung
fr_fr: Prise de décision automatisée

source: Back to Home
de_de: Zurück zur Startseite
fr_fr: Retour à l'accueil

source: Back to Registration
de_de: Zurück zur Registrierung
fr_fr: Retour à l'inscription

source: Back to sign in
de_de: Zurück zur Anmeldung
fr_fr: Retour à la connexion

source: By accessing or using {0}, you agree to be bound by these Terms of Service and all applicable laws and regulations. If you do not agree with any of these terms, you are prohibited from using this platform.
de_de: Durch den Zugriff auf oder die Nutzung von {0} erklären Sie sich mit diesen Nutzungsbedingungen sowie allen anwendbaren Gesetzen und Vorschriften einverstanden. Wenn Sie diesen Bedingungen nicht zustimmen, ist Ihnen die Nutzung dieser Plattform untersagt.
fr_fr: En accédant ou en utilisant {0}, vous acceptez d'être lié par ces Conditions d'utilisation et toutes les lois et réglementations applicables. Si vous n'acceptez pas l'une de ces conditions, vous êtes interdit d'utiliser cette plateforme.

source: By continuing, you agree to our <0>Terms of Service</0> and <1>Privacy Policy</1>.
de_de: Durch die Fortsetzung erklären Sie sich mit unseren <0>Nutzungsbedingungen</0> und unserer <1>Datenschutzerklärung</1> einverstanden.
fr_fr: En continuant, vous acceptez nos <0>Conditions d'utilisation</0> et notre <1>Politique de confidentialité</1>.

source: By signing up, you agree to our <0>Terms of Service</0> and <1>Privacy Policy</1>.
de_de: Mit der Registrierung erklären Sie sich mit unseren <0>Nutzungsbedingungen</0> und unserer <1>Datenschutzerklärung</1> einverstanden.
fr_fr: En vous inscrivant, vous acceptez nos <0>Conditions d'utilisation</0> et notre <1>Politique de confidentialité</1>.

source: Carefully organized lessons covering grammar, morphology, and rhetoric progressively.
de_de: Sorgfältig strukturierte Lektionen zu Grammatik, Morphologie und Rhetorik in aufbauender Reihenfolge.
fr_fr: Des leçons soigneusement organisées couvrant progressivement la grammaire, la morphologie et la rhétorique.

source: Check your email
de_de: Überprüfen Sie Ihre E-Mails
fr_fr: Vérifiez vos e-mails

source: Check Your Email
de_de: Überprüfen Sie Ihre E-Mails
fr_fr: Vérifiez vos e-mails

source: Choose a strong password for your account
de_de: Wählen Sie ein sicheres Passwort für Ihr Konto
fr_fr: Choisissez un mot de passe fort pour votre compte

source: Close menu
de_de: Menü schließen
fr_fr: Fermer le menu

source: Collaborative Learning
de_de: Gemeinschaftliches Lernen
fr_fr: Apprentissage collaboratif

source: Coming Soon
de_de: Demnächst verfügbar
fr_fr: Bientôt disponible

source: Community-Driven Content
de_de: Community-getriebene Inhalte
fr_fr: Contenu communautaire

source: Confirm Password
de_de: Passwort Bestätigen
fr_fr: Confirmer le mot de passe

source: Confirm your password
de_de: Bestätigen Sie Ihr Passwort
fr_fr: Confirmez votre mot de passe

source: Consumer Rights
de_de: Verbraucherrechte
fr_fr: Droits des consommateurs

source: Contact
de_de: Kontakt

source: Contact Form??
de_de: Kontaktformular??
fr_fr: Formulaire de contact ??

source: Contact Us
de_de: Kontaktieren Sie uns
fr_fr: Nous contacter

source: Content and works created by the site operator on this website are subject to copyright law. Duplication, processing, distribution, or any form of commercialization requires prior written consent.
de_de: Die vom Betreiber dieser Website erstellten Inhalte und Werke unterliegen dem Urheberrecht. Vervielfältigung, Bearbeitung, Verbreitung oder jede Art der Verwertung außerhalb der Grenzen des Urheberrechts bedürfen der vorherigen schriftlichen Zustimmung.
fr_fr: Le contenu et les œuvres créés par l'exploitant du site sur ce site Web sont soumis au droit d'auteur. La duplication, le traitement, la distribution ou toute forme de commercialisation nécessite un consentement écrit préalable.

source: Continue to App
de_de: Zur App fortfahren
fr_fr: Continuer vers l'application

source: Copyright
de_de: Urheberrecht
fr_fr: Droits d'auteur

source: Create Account
de_de: Konto erstellen
fr_fr: Créer un compte

source: Create your Account
de_de: Erstellen Sie Ihr Konto
fr_fr: Créez votre compte

source: Create Your Free Account
de_de: Erstellen Sie Ihr kostenloses Konto
fr_fr: Créez votre compte gratuit

source: Data Controller
de_de: Verantwortlicher
fr_fr: Responsable du traitement

source: Data Retention
de_de: Speicherdauer
fr_fr: Conservation des données

source: Data Security
de_de: Datensicherheit
fr_fr: Sécurité des données

source: Data Sharing and Recipients
de_de: Teilen von Daten und Empfänger
fr_fr: Partage des données et destinataires

source: Data We Collect
de_de: Erhobene Daten
fr_fr: Données que nous collectons

source: Didn't receive the email? Check your spam folder or try again with a different email address.
de_de: Keine E-Mail erhalten? Überprüfe den Spamordner oder probiere eine andere E-Mail Adresse.
fr_fr: Vous n'avez pas reçu l'e-mail ? Vérifiez votre dossier spam ou réessayez avec une autre adresse e-mail.

source: Didn't receive the email? Check your spam folder or try again.
de_de: Sie haben die E-Mail nicht erhalten? Überprüfen Sie Ihren Spam-Ordner oder versuchen Sie es erneut.

source: Didn't receive the email? Check your spam folder or try signing up again.
de_de: Keine E-Mail erhalten? Überprüfe den Spamordner oder versuche es erneut.
fr_fr: Vous n'avez pas reçu l'e-mail ? Vérifiez votre dossier spam ou réessayez de vous inscrire.

source: Don't have an account yet?
de_de: Noch kein Konto verhanden?
fr_fr: Vous n'avez pas encore de compte ?

source: Email
de_de: E-Mail-Adresse

source: Email Verified!
de_de: E-Mail-Adresse bestätigt!
fr_fr: E-mail vérifié !

source: Enter your email
de_de: Geben Sie Ihre E-Mail-Adresse ein

source: Enter your email address and we'll send you a new verification link.
de_de: Geben Sie Ihre E-Mail-Adresse ein und wir senden Ihnen einen neuen Bestätigungslink zu.

source: Enter your email and we'll send you reset instructions
de_de: Geben Sie Ihre E-Mail-Adresse ein, wir senden Ihnen Anweisungen zum Zurücksetzen
fr_fr: Entrez votre e-mail et nous vous enverrons les instructions de réinitialisation

source: Enter your first name
de_de: Geben Sie Ihren Vornamen ein
fr_fr: Entrez votre prénom

source: Enter your last name
de_de: Gib Sie Ihren Nachnamen ein
fr_fr: Entrez votre nom de famille

source: Enter your password
de_de: Geben Sie Ihr Passwort ein
fr_fr: Entrez votre mot de passe

source: First Name
de_de: Vorname
fr_fr: Prénom

source: First name is required
de_de: Vorname erforderlich
fr_fr: Le prénom est requis

source: Forgot password?
de_de: Passwort vergessen?
fr_fr: Mot de passe oublié ?

source: Forgot Password?
de_de: Passwort vergessen?
fr_fr: Mot de passe oublié ?

source: Go to homepage
de_de: Zur Startseite
fr_fr: Aller à la page d'accueil

source: Governing Law and Jurisdiction
de_de: Anwendbares Recht und Gerichtsstand
fr_fr: Droit applicable et juridiction

source: However, we are not obligated to monitor transmitted or stored third-party information or to actively investigate circumstances that indicate illegal activity.
de_de: Wir sind jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder aktiv nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen.
fr_fr: Cependant, nous ne sommes pas obligés de surveiller les informations transmises ou stockées par des tiers ou d'enquêter activement sur des circonstances indiquant une activité illégale.

source: If an account exists for {userEmail}, we have sent a new verification email.
de_de: Wenn ein Konto für {userEmail} existiert, haben wir eine neue Bestätigungs-E-Mail gesendet.

source: If an account exists for {userEmail}, we have sent password reset instructions.
de_de: Sofern ein Konto für {userEmail} existiert, haben wir Anweisungen zum Zurücksetzen des Passworts versendet.
fr_fr: Si un compte existe pour {userEmail}, nous avons envoyé les instructions de réinitialisation du mot de passe.

source: If you are a consumer residing in the European Union, you benefit from mandatory consumer protection rights under applicable EU and national laws. Nothing in these Terms limits or excludes those rights.
de_de: Wenn Sie Verbraucher mit Wohnsitz in der Europäischen Union sind, profitieren Sie von den zwingenden Verbraucherschutzrechten nach EU- und nationalem Recht. Diese Nutzungsbedingungen schränken diese Rechte nicht ein.
fr_fr: Si vous êtes un consommateur résidant dans l'Union européenne, vous bénéficiez de droits obligatoires de protection des consommateurs en vertu des lois européennes et nationales applicables. Rien dans ces Conditions ne limite ou n'exclut ces droits.

source: If you are a consumer, this choice of law does not deprive you of the protection afforded by mandatory provisions of the law of your country of residence.
de_de: Wenn Sie Verbraucher sind, entzieht Ihnen diese Rechtswahl nicht den Schutz zwingender Bestimmungen des Rechts Ihres Wohnsitzstaates.
fr_fr: Si vous êtes un consommateur, ce choix de loi ne vous prive pas de la protection offerte par les dispositions impératives de la loi de votre pays de résidence.

source: If you have any questions about this Privacy Policy or the processing of your personal data, please contact us. There is no dedicated privacy email available yet.
de_de: Wenn Sie Fragen zu dieser Datenschutzerklärung oder zur Verarbeitung Ihrer personenbezogenen Daten haben, kontaktieren Sie uns bitte. Eine spezielle Datenschutz-E-Mail-Adresse steht derzeit noch nicht zur Verfügung.
fr_fr: Si vous avez des questions concernant cette Politique de confidentialité ou le traitement de vos données personnelles, veuillez nous contacter. Il n'y a pas encore d'adresse e-mail dédiée à la confidentialité.

source: Imprint
de_de: Impressum
fr_fr: Mentions légales

source: Intellectual Property
de_de: Geistiges Eigentum
fr_fr: Propriété intellectuelle

source: International Data Transfers
de_de: Internationale Datenübermittlungen
fr_fr: Transferts internationaux de données

source: Introduction
de_de: Einleitung

source: Invalid email or password
de_de: Ungültige E-Mail-Adresse oder Passwort

source: Join a community of learners and contributors passionate about Arabic.
de_de: Werden Sie Teil einer Community von Lernenden und Mitwirkenden mit Begeisterung für die arabische Sprache.
fr_fr: Rejoignez une communauté d'apprenants et de contributeurs passionnés par l'arabe.

source: Join learners and contributors shaping the future of Arabic language education.
de_de: Schließen Sie sich Lernenden und Mitwirkenden an, die die Zukunft der arabischen Sprachbildung gestalten.
fr_fr: Rejoignez les apprenants et contributeurs qui façonnent l'avenir de l'enseignement de la langue arabe.

source: Language
de_de: Sprache
fr_fr: Langue

source: Last Name
de_de: Nachname
fr_fr: Nom de famille

source: Last name is required
de_de: Nachname erforderlich
fr_fr: Le nom de famille est requis

source: Last updated: {0}
de_de: Zuletzt aktualisiert: {0}
fr_fr: Dernière mise à jour : {0}

source: Learn in English, with German, French, and more languages coming soon.
de_de: Lernen Sie auf Englisch – Deutsch, Französisch und weitere Sprachen folgen in Kürze.
fr_fr: Apprenez en anglais, avec l'allemand, le français et d'autres langues bientôt disponibles.

source: Learn on any device with a responsive, accessible design.
de_de: Lernen Sie auf jedem Gerät mit einem responsiven und barrierearmen Design.
fr_fr: Apprenez sur n'importe quel appareil avec un design réactif et accessible.

source: Learning Content
de_de: Lerninhalte
fr_fr: Contenu pédagogique

source: Legal
de_de: Rechtliches
fr_fr: Légal

source: Legal Basis for Processing
de_de: Rechtsgrundlage der Verarbeitung
fr_fr: Base juridique du traitement

source: Liability for Content
de_de: Haftung für Inhalte
fr_fr: Responsabilité du contenu

source: Liability for Links
de_de: Haftung für Links
fr_fr: Responsabilité des liens

source: Limitation of Liability
de_de: Haftungsbeschränkung
fr_fr: Limitation de responsabilité

source: Login
de_de: Anmelden
fr_fr: Connexion

source: Logout
de_de: Abmelden
fr_fr: Déconnexion

source: Master Classical Arabic (Fusha)
de_de: Beherrschen Sie klassisches Arabisch (Fusha)
fr_fr: Maîtrisez l'arabe classique (Fusha)

source: Master فصحى, the standard arabic language used in the Qur'an, literature, and news.
de_de: Meistern Sie فصحى, die standardisierte arabische Sprache des Korans, der Literatur und der Nachrichten.
fr_fr: Maîtrisez le فصحى, la langue arabe standard utilisée dans le Coran, la littérature et les actualités.

source: Menu
de_de: Menü

source: Modifications
de_de: Änderungen

source: Morphology & Word Patterns
de_de: Morphologie & Wortmuster
fr_fr: Morphologie et structures des mots

source: Multi-Language Interface
de_de: Mehrsprachige Benutzeroberfläche
fr_fr: Interface multilingue

source: Non-Commercial Notice
de_de: Hinweis zur Nichtkommerzialität
fr_fr: Avis non commercial

source: Obligations to remove or block the use of information under general laws remain unaffected. Liability in this regard is only possible from the point in time at which a specific infringement becomes known. Upon becoming aware of such violations, we will remove the content immediately.
de_de: Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben unberührt. Eine Haftung ist erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden entsprechender Rechtsverletzungen werden wir die Inhalte umgehend entfernen.
fr_fr: Les obligations de suppression ou de blocage de l'utilisation d'informations en vertu des lois générales restent inchangées. La responsabilité à cet égard n'est possible qu'à partir du moment où une infraction spécifique devient connue. Dès que nous prenons connaissance de telles violations, nous supprimons immédiatement le contenu.

source: Open & Transparent
de_de: Offen & transparent
fr_fr: Ouvert et transparent

source: Open menu
de_de: Menü öffnen
fr_fr: Ouvrir le menu

source: Open the GitHub repository in a new browser tab.
de_de: GitHub-Repository in einem neuen Browser-Tab öffnen.
fr_fr: Ouvrir le dépôt GitHub dans un nouvel onglet du navigateur.

source: Password
de_de: Passwort
fr_fr: Mot de passe

source: Password confirmation is required
de_de: Passwortbestätigung erforderlich
fr_fr: La confirmation du mot de passe est requise

source: Password is required
de_de: Passwort erforderlich
fr_fr: Le mot de passe est requis

source: Password must be at least {USER_PASSWORD_MIN_LENGTH} characters long
de_de: Das Passwort muss mindestens {USER_PASSWORD_MIN_LENGTH} Zeichen lang sein
fr_fr: Le mot de passe doit contenir au moins {USER_PASSWORD_MIN_LENGTH} caractères

source: Password must contain at least one lowercase letter
de_de: Das Passwort muss mindestens einen Kleinbuchstaben enthalten
fr_fr: Le mot de passe doit contenir au moins une lettre minuscule

source: Password must contain at least one number
de_de: Das Passwort muss mindestens eine Zahl enthalten
fr_fr: Le mot de passe doit contenir au moins un chiffre
