Repository: Menahra/lasl
Catalog: apps/frontend/src/locales/*/messages.po
Languages: de_de, fr_fr

source: Password must contain at least one uppercase letter
de_de: Das Passwort muss mindestens einen Großbuchstaben enthalten
fr_fr: Le mot de passe doit contenir au moins une lettre majuscule

source: Password reset!
de_de: Passwort zurückgesetzt!
fr_fr: Mot de passe réinitialisé !

source: Passwords do not match
de_de: Passwörter stimmen nicht überein
fr_fr: Les mots de passe ne correspondent pas

source: Permission is granted to temporarily access the materials on{0} for personal, non-commercial use only. This is the grant of a license, not a transfer of title, and under this license you may not:
de_de: Es wird die Erlaubnis erteilt, die Materialien auf {0} ausschließlich vorübergehend für den persönlichen, nichtkommerziellen Gebrauch zu nutzen. Dies stellt eine Lizenz dar, keine Eigentumsübertragung. Unter dieser Lizenz ist es nicht gestattet:
fr_fr: L'autorisation est accordée d'accéder temporairement aux contenus sur {0} uniquement pour un usage personnel et non commercial. Il s'agit de l'octroi d'une licence, et non d'un transfert de titre, et en vertu de cette licence, vous ne pouvez pas :

source: Personal data is processed exclusively within the European Union. No transfer of personal data to third countries takes place.
de_de: Die Verarbeitung personenbezogener Daten erfolgt ausschließlich innerhalb der Europäischen Union. Eine Übermittlung in Drittländer findet nicht statt.
fr_fr: Les données personnelles sont traitées exclusivement au sein de l'Union européenne. Aucun transfert de données personnelles vers des pays tiers n'a lieu.

source: Please enter a valid email address
de_de: Bitte geben Sie eine gültige E-Mail-Adresse ein
fr_fr: Veuillez entrer une adresse e-mail valide

source: Please verify your email first
de_de: Bitte bestätigen Sie zunächst Ihre E-Mail-Adresse
fr_fr: Veuillez d'abord vérifier votre e-mail

source: Privacy and Data Protection
de_de: Datenschutz und Privatsphäre
fr_fr: Confidentialité et protection des données

source: Privacy Policy
de_de: Datenschutzerklärung
fr_fr: Politique de confidentialité

source: Purposes of Processing
de_de: Zwecke der Verarbeitung
fr_fr: Finalités du traitement

source: Ready to Begin Your Arabic Journey?
de_de: Bereit, Ihre Reise in die arabische Sprache zu beginnen?
fr_fr: Prêt à commencer votre parcours en arabe ?

source: Redirecting you to the app in a few seconds...
de_de: Sie werden in wenigen Sekunden zur App weitergeleitet...
fr_fr: Redirection vers l'application dans quelques secondes...

source: Resend verification Email
de_de: Bestätigungs-E-Mail erneut senden

source: Resend Verification Email
de_de: Bestätigungs-E-Mail erneut senden

source: Reset password
de_de: Passwort zurücksetzen
fr_fr: Réinitialiser le mot de passe

source: Resources
de_de: Ressourcen
fr_fr: Ressources

source: Responsibility for Content
de_de: Verantwortung für Inhalte
fr_fr: Responsabilité du contenu

source: Responsible for Content
de_de: Inhaltlich verantwortlich
fr_fr: Responsable du contenu

source: Responsible for content according to § 55 Abs. 2 RStV:
de_de: Verantwortlich für den Inhalt nach § 55 Abs. 2 RStV:
fr_fr: Responsable du contenu selon § 55 Abs. 2 RStV :

source: Retry in {retryAfter}s
de_de: In {retryAfter}s erneut versuchen

source: Rhetoric & Eloquence
de_de: Rhetorik & Sprachgewandtheit
fr_fr: Rhétorique et éloquence

source: Search in all pages
de_de: Auf allen Seiten suchen
fr_fr: Rechercher dans toutes les pages

source: Search...
de_de: Suchen...
fr_fr: Rechercher...

source: Send reset link
de_de: Link zum Zurücksetzen senden
fr_fr: Envoyer le lien de réinitialisation

source: Send to a different email
de_de: An eine andere E-Mail-Adresse senden

source: Service Provider
de_de: Diensteanbieter
fr_fr: Fournisseur de services

source: Set new password
de_de: Neues Passwort festlegen
fr_fr: Définir un nouveau mot de passe

source: Sign In
de_de: Anmelden
fr_fr: Se connecter

source: Sign in to enhance your learning
de_de: Melden Sie sich an, um Ihr Lernen zu vertiefen
fr_fr: Connectez-vous pour améliorer votre apprentissage

source: Sign in with new password
de_de: Mit neuem Passwort anmelden
fr_fr: Se connecter avec le nouveau mot de passe

source: Sign Up
de_de: Registrieren
fr_fr: S'inscrire

source: Start Learning Free
de_de: Kostenlos lernen
fr_fr: Commencer à apprendre gratuitement

source: Structured Curriculum
de_de: Strukturierter Lehrplan
fr_fr: Programme structuré

source: student@example.com
de_de: student@beispiel.de
fr_fr: etudiant@exemple.com

source: Support this project on Ko-Fi
de_de: Unterstützen Sie dieses Projekt auf Ko-Fi
fr_fr: Soutenez ce projet sur Ko-Fi

source: Surface language
de_de: Oberflächensprache
fr_fr: Langue d'interface

source: Switch to dark mode
de_de: In den Dunkelmodus wechseln
fr_fr: Passer en mode sombre

source: Switch to light mode
de_de: In den Hellmodus wechseln
fr_fr: Passer en mode clair

source: Termination
de_de: Beendigung
fr_fr: Résiliation

source: Terms of Service
de_de: Nutzungsbedingungen
fr_fr: Conditions d'utilisation

source: Testing a wrong translation to see whether workflow works
de_de: Prüfung einer falschen Übersetzung, um zu sehen, ob Workflow funktioniert

source: The contents of this website have been created with the greatest possible care. However, no guarantee is given for the accuracy, completeness, or timeliness of the content.
de_de: Die Inhalte dieser Website wurden mit größtmöglicher Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte wird jedoch keine Gewähr übernommen.
fr_fr: Le contenu de ce site Web a été créé avec le plus grand soin. Cependant, aucune garantie n'est donnée quant à l'exactitude, l'exhaustivité ou l'actualité du contenu.

source: The data controller responsible for the processing of personal data within the meaning of the GDPR is:
de_de: Verantwortlicher für die Verarbeitung personenbezogener Daten im Sinne der DSGVO ist:
fr_fr: Le responsable du traitement des données personnelles au sens du RGPD est :

source: The language learning materials provided on {0} are for educational purposes. While we strive for accuracy, we make no guarantees about the completeness or accuracy of the content. Users should verify important information independently.
de_de: Die auf {0} bereitgestellten Lernmaterialien dienen ausschließlich Bildungszwecken. Trotz sorgfältiger Erstellung übernehmen wir keine Gewähr für Vollständigkeit oder Richtigkeit. Wichtige Informationen sollten eigenständig überprüft werden.
fr_fr: Les supports d'apprentissage des langues fournis sur {0} sont à des fins éducatives. Bien que nous nous efforcions d'être précis, nous ne garantissons pas l'exhaustivité ou l'exactitude du contenu. Les utilisateurs doivent vérifier les informations importantes de manière indépendante.

source: The processing of personal data is governed by our <0>Privacy Policy</0>, which explains how we collect, use, and protect your personal information in accordance with the General Data Protection Regulation (GDPR).
de_de: Die Verarbeitung personenbezogener Daten richtet sich nach unserer <0>Datenschutzerklärung</0>, in der erläutert wird, wie wir Ihre personenbezogenen Daten gemäß der Datenschutz-Grundverordnung (DSGVO) erheben, verwenden und schützen.
fr_fr: Le traitement des données personnelles est régi par notre <0>Politique de confidentialité</0>, qui explique comment nous collectons, utilisons et protégeons vos informations personnelles conformément au Règlement général sur la protection des données (RGPD).

source: The verification link is invalid or has expired. Please try signing up again.
de_de: Der Bestätigungslink ist ungültig oder abgelaufen. Bitte versuchen Sie sich erneut anzumelden.

source: Theme
de_de: Design
fr_fr: Thème

source: There is currently no direct email contact available. Please use the contact options provided within the platform.
de_de: Derzeit steht keine direkte E-Mail-Kontaktmöglichkeit zur Verfügung. Bitte nutzen Sie die innerhalb der Plattform angebotenen Kontaktmöglichkeiten.
fr_fr: Il n'y a actuellement aucun contact e-mail direct disponible. Veuillez utiliser les options de contact fournies dans la plateforme.

source: There is no E-Mail available yet. Stay tuned.
de_de: Derzeit steht noch keine E-Mail-Adresse zur Verfügung.
fr_fr: Aucun e-mail n'est encore disponible. Restez à l'écoute.

source: These Terms apply upon registration and continued use of the service.
de_de: Diese Nutzungsbedingungen gelten ab der Registrierung und für die fortgesetzte Nutzung des Dienstes.
fr_fr: Ces Conditions s'appliquent lors de l'inscription et de l'utilisation continue du service.

source: These Terms shall be governed by the laws of Germany, excluding its conflict-of-law provisions.
de_de: Diese Nutzungsbedingungen unterliegen dem Recht der Bundesrepublik Deutschland unter Ausschluss des Kollisionsrechts.
fr_fr: Ces Conditions sont régies par les lois allemandes, à l'exclusion de ses dispositions relatives aux conflits de lois.

source: This email is already registered. <0>Sign in instead</0>
de_de: Diese E-Mail-Adresse ist bereits registriert. <0>Stattdessen anmelden</0>
fr_fr: Cet e-mail est déjà enregistré. <0>Connectez-vous plutôt</0>

source: This limitation of liability does not apply in cases of intent, gross negligence, or where liability is mandatory under applicable consumer protection laws.
de_de: Diese Haftungsbeschränkung gilt nicht bei Vorsatz, grober Fahrlässigkeit oder in Fällen zwingender gesetzlicher Haftung nach Verbraucherschutzrecht.
fr_fr: Cette limitation de responsabilité ne s'applique pas en cas d'intention, de négligence grave ou lorsque la responsabilité est obligatoire en vertu des lois applicables de protection des consommateurs.

source: This link is invalid or has expired.
de_de: Dieser Link ist ungültig oder abgelaufen.

source: This project is operated as a non-commercial, experimental hobby project.
de_de: Dieses Projekt wird als nichtkommerzielles, experimentelles Hobbyprojekt betrieben.
fr_fr: Ce projet est exploité comme un projet amateur expérimental et non commercial.

source: This service is provided by {0} {1}, with his registered address at {2} {3}, {4} {5} ({6}).
de_de: Dieser Dienst wird bereitgestellt von {0} {1}, mit eingetragener Anschrift in {2} {3}, {4} {5} ({6}).
fr_fr: Ce service est fourni par {0} {1}, dont l'adresse enregistrée est au {2} {3}, {4} {5} ({6}).

source: This website is operated as a private, non-commercial hobby project. No commercial services are offered. No intention of profit exists.
de_de: Diese Website wird als privates, nichtkommerzielles Hobbyprojekt betrieben. Es werden keine kommerziellen Dienstleistungen angeboten. Eine Gewinnerzielungsabsicht besteht nicht.
fr_fr: Ce site Web est exploité comme un projet amateur privé et non commercial. Aucun service commercial n'est proposé. Aucune intention de profit n'existe.

source: This website may contain links to external third-party websites. We have no influence over the contents of those websites and therefore assume no liability for external content.
de_de: Diese Website kann Links zu externen Webseiten Dritter enthalten. Auf deren Inhalte haben wir keinen Einfluss und übernehmen daher keine Haftung für externe Inhalte.
fr_fr: Ce site Web peut contenir des liens vers des sites Web tiers externes. Nous n'avons aucune influence sur le contenu de ces sites Web et n'assumons donc aucune responsabilité pour le contenu externe.

source: To the extent permitted by applicable law, {0} shall not be liable for any indirect, incidental, special, or consequential damages arising out of or in connection with the use or inability to use the service.
de_de: Soweit gesetzlich zulässig, haftet {0} nicht für indirekte, zufällige, besondere oder Folgeschäden, die aus der Nutzung oder der Unmöglichkeit der Nutzung des Dienstes entstehen.
fr_fr: Dans la mesure permise par la loi applicable, {0} ne sera pas responsable de tout dommage indirect, accessoire, spécial ou consécutif découlant de ou en relation avec l'utilisation ou l'impossibilité d'utiliser le service.

source: Too many attempts. Please wait {0, plural, one {# second} other {# seconds}}.
de_de: Zu viele Versuche. Bitte warten Sie {0, plural, one {# Sekunde} other {# Sekunden}}.

source: Try again
de_de: Erneut versuchen

source: Try another email
de_de: Andere E-Mail-Adresse versuchen
fr_fr: Essayer un autre e-mail

source: Under the GDPR, you have the right to access, correct, delete, or restrict the processing of your personal data. You also have the right to data portability and to object to certain processing activities.
de_de: Nach der DSGVO haben Sie das Recht auf Auskunft, Berichtigung, Löschung oder Einschränkung der Verarbeitung Ihrer personenbezogenen Daten. Zudem haben Sie das Recht auf Datenübertragbarkeit sowie ein Widerspruchsrecht.
fr_fr: En vertu du RGPD, vous avez le droit d'accéder, de corriger, de supprimer ou de restreindre le traitement de vos données personnelles. Vous avez également le droit à la portabilité des données et de vous opposer à certaines activités de traitement.

source: Use License
de_de: Nutzungslizenz
fr_fr: Licence d'utilisation

source: User Accounts
de_de: Benutzerkonten
fr_fr: Comptes utilisateurs

source: Verification Failed!
de_de: Überprüfung fehlgeschlagen!

source: View source code on GitHub
de_de: Quellcode auf GitHub ansehen
fr_fr: Voir le code source sur GitHub

source: View, suggest changes, and contribute to the learning materials directly.
de_de: Lernmaterialien ansehen, Änderungsvorschläge machen und direkt mitwirken.
fr_fr: Consultez, suggérez des modifications et contribuez directement aux supports d'apprentissage.

source: Visit Ko-Fi to support this project with a donation.
de_de: Besuchen Sie Ko-Fi, um dieses Projekt mit einer Spende zu unterstützen.
fr_fr: Visitez Ko-Fi pour soutenir ce projet avec un don.

source: We collect and process the following categories of data:
de_de: Wir erheben und verarbeiten die folgenden Datenkategorien:
fr_fr: Nous collectons et traitons les catégories de données suivantes :

source: We do not sell or rent personal data. Personal data is not shared with third parties, except where required by law or where technical service providers are used to operate the platform under data processing agreements.
de_de: Wir verkaufen oder vermieten keine personenbezogenen Daten. Eine Weitergabe erfolgt nur, sofern dies gesetzlich erforderlich ist oder technische Dienstleister im Rahmen von Auftragsverarbeitungsverträgen eingesetzt werden.
fr_fr: Nous ne vendons ni ne louons de données personnelles. Les données personnelles ne sont pas partagées avec des tiers, sauf si la loi l'exige ou lorsque des prestataires de services techniques sont utilisés pour exploiter la plateforme dans le cadre d'accords de traitement des données.

source: We do not use automated decision-making or profiling within the meaning of Art. 22 GDPR.
de_de: Wir nutzen keine automatisierte Entscheidungsfindung oder Profiling im Sinne von Art. 22 DSGVO.
fr_fr: Nous n'utilisons pas de prise de décision automatisée ou de profilage au sens de l'art. 22 du RGPD.

source: We may suspend or terminate your access to {0} immediately, without prior notice, if you breach these Terms or applicable laws.
de_de: Wir können Ihren Zugriff auf {0} bei Verstoß gegen diese Nutzungsbedingungen oder geltendes Recht jederzeit und ohne vorherige Ankündigung sperren oder beenden.
fr_fr: Nous pouvons suspendre ou résilier votre accès à {0} immédiatement, sans préavis, si vous enfreignez ces Conditions ou les lois applicables.

source: We process personal data on the following legal bases in accordance with Art. 6 GDPR:
de_de: Die Verarbeitung personenbezogener Daten erfolgt auf folgenden Rechtsgrundlagen gemäß Art. 6 DSGVO:
fr_fr: Nous traitons les données personnelles sur les bases juridiques suivantes conformément à l'art. 6 du RGPD :

source: We respect your privacy and are committed to protecting your personal data. This Privacy Policy explains how we collect, use, and protect your personal data when you use {0}, as well as your rights under the General Data Protection Regulation (GDPR).
de_de: Wir respektieren Ihre Privatsphäre und verpflichten uns zum Schutz Ihrer personenbezogenen Daten. Diese Datenschutzerklärung erläutert, wie wir Ihre Daten bei der Nutzung von {0} erheben, verwenden und schützen sowie welche Rechte Ihnen nach der DSGVO zustehen.
fr_fr: Nous respectons votre vie privée et nous nous engageons à protéger vos données personnelles. Cette Politique de confidentialité explique comment nous collectons, utilisons et protégeons vos données personnelles lorsque vous utilisez {0}, ainsi que vos droits en vertu du Règlement général sur la protection des données (RGPD).

source: We store personal data only for as long as necessary to fulfill the purposes for which it was collected.
de_de: Personenbezogene Daten werden nur so lange gespeichert, wie es für die jeweiligen Verarbeitungszwecke erforderlich ist.
fr_fr: Nous conservons les données personnelles uniquement aussi longtemps que nécessaire pour accomplir les finalités pour lesquelles elles ont été collectées.

source: We've sent a verification link to your email address. Please click the link to verify your account.
de_de: Wir haben einen Bestätigungslink an Ihre E-Mail-Adresse gesendet. Bitte klicken Sie auf den Link, um Ihr Konto zu verifizieren.
fr_fr: Nous avons envoyé un lien de vérification à votre adresse e-mail. Veuillez cliquer sur le lien pour vérifier votre compte.

source: Welcome back
de_de: Willkommen zurück
fr_fr: Bienvenue

source: What You Will Learn
de_de: Was Sie lernen werden
fr_fr: Ce que vous allez apprendre

source: When you create an account with us, you must provide accurate, complete, and current information. Failure to do so constitutes a breach of the Terms, which may result in immediate termination of your account.
de_de: Bei der Erstellung eines Kontos müssen Sie korrekte, vollständige und aktuelle Angaben machen. Andernfalls liegt ein Verstoß gegen diese Nutzungsbedingungen vor, der zur sofortigen Kündigung des Kontos führen kann.
fr_fr: Lorsque vous créez un compte chez nous, vous devez fournir des informations exactes, complètes et à jour. Le non-respect de cette obligation constitue une violation des Conditions, ce qui peut entraîner la résiliation immédiate de votre compte.

source: Where processing is based on consent, you may withdraw your consent at any time. You also have the right to lodge a complaint with a supervisory authority.
de_de: Soweit die Verarbeitung auf Ihrer Einwilligung beruht, können Sie diese jederzeit widerrufen. Zudem haben Sie das Recht, sich bei einer Aufsichtsbehörde zu beschweren.
fr_fr: Lorsque le traitement est basé sur le consentement, vous pouvez retirer votre consentement à tout moment. Vous avez également le droit de déposer une plainte auprès d'une autorité de contrôle.

source: Why {0}?
de_de: Warum {0}?
fr_fr: Pourquoi {0} ?

source: You are responsible for safeguarding the password that you use to access the platform and for any activities or actions under your password.
de_de: Sie sind dafür verantwortlich, Ihr Passwort zu schützen und für alle Aktivitäten verantwortlich, die unter Verwendung Ihres Passworts erfolgen.
fr_fr: Vous êtes responsable de la protection du mot de passe que vous utilisez pour accéder à la plateforme et de toutes les activités ou actions effectuées sous votre mot de passe.

source: You do not have permission to access this.
de_de: Sie haben keine Berechtigung darauf zuzugreifen.

source: your email
de_de: Ihre E-Mail-Adresse
fr_fr: votre e-mail

source: your email address
de_de: Ihre E-Mail-Adresse

source: Your email has been successfully verified.
de_de: Ihre E-Mail-Adresse wurde erfolgreich bestätigt.
fr_fr: Votre e-mail a été vérifié avec succès.

source: Your password has been successfully updated.
de_de: Ihr Passwort wurde erfolgreich aktualisiert.
fr_fr: Votre mot de passe a été mis à jour avec succès.

source: Your personal data is used for the following purposes:
de_de: Ihre personenbezogenen Daten werden zu folgenden Zwecken verwendet:
fr_fr: Vos données personnelles sont utilisées aux fins suivantes :

source: Your Rights
de_de: Ihre Rechte
fr_fr: Vos droits

source: An unexpected error occurred. Please try again.
fr_fr: Une erreur inattendue s'est produite. Veuillez réessayer.

source: Invalid Email or password. Please try again
fr_fr: E-mail ou mot de passe invalide. Veuillez réessayer

source: This password reset link is invalid or has expired.
fr_fr: Ce lien de réinitialisation du mot de passe est invalide ou a expiré.
